<template>
  <v-container>
    <template
      v-if="planet"
    >
      <v-card-title>
        <h2>
          <router-link
            :to="planet.url"
            v-text="planet.name"
          ></router-link>
        </h2>
      </v-card-title>

      <v-layout row wrap>
          <v-flex xs4>
            <v-container>
              <v-card>
                <v-container>
                  <div
                    v-html="planet.html"
                  ></div>
                </v-container>
              </v-card>
            </v-container>
          </v-flex>
          <v-flex xs4>
            <v-container>
              <v-card>
                <v-card-title>
                  <h3>Природа и люди</h3>
                </v-card-title>
                <v-container>
                <h4>{{planet.name}} как планета и ее изображение на карте</h4>
                <ul>
                  <li
                    v-for="article in planet.about"
                    :key="article.title"
                  >
                    <router-link
                      :to="`${planet.url}/wiki/${article.title}`"
                      v-text="article.title"
                    ></router-link>
                    <ul
                      v-if="article.children"
                    >
                      <li
                        v-for="child in article.children"
                        :key="child.title"
                      >
                        <router-link
                          :to="`${planet.url}/wiki/${article.title}/${child.title}`"
                          v-text="child.title"
                        ></router-link>
                      </li>
                    </ul>
                  </li>
                </ul>
                <h4>Строение Земли</h4>
                 <ul>
                  <li>
                  * Поверхность Земли
                    * Мировой океан
                    * Воздушный океан
                    * Сфера жизни
                    * Плотность Земли
                  </li>
                  <li>
                  * Земля - большой магнит
                    * Магнитная стрелка - указатель стран света
                    * Магнитное поле Земли
                    * Магнитное склонение. Магнитные полюсы
                    * Навигация
                    * Служба земного магнетизма
                    * Земной магнетизм дает возможность разведывать недра земного шара
                    * Изменения магнитного поля Земли
                    * Магнитные бури. Полярные сияния
                    * Происхождение магнитного поля Земли
                        * 64/65
                  </li>
                </ul>
                <h4>Суша</h4>
                <ul>
                  <li>
                * Рельеф суши
                    * Значение рельефа для климата и растительности
                    * Основные формы рельефа
                    * Как возникают формы рельефа
                    * Как изучают рельеф Земли
                    * Значение рельефа Земли в хозяйственной деятельности человека
                  </li>
                </ul>
                <h4>Водная оболочка Земли</h4>
                <ul>
                  <li>
                * Океаны и моря
                    * Рельеф дна Мирового океана
                    * Северный Ледовитый океан
                    * Атлантический океан
                    * Индийский океан
                    * Тихий океан
                    * Глубины морей
                    * Соленость морской воды
                    * Температура морской воды
                        * 80/81
                    * Замерзание морской воды
                    * Круговорот воды в Мировом океане
                  </li>
                  <li>
                * Течения Мирового океана
                    * Причины морских течений
                    * Схемы течений Мирового океана
                    * Влияние морских течений на климат и судозодство
                  </li>
                  <li>
                * Приливы и отливы
                    * Нагон и сгон воды. "Моряна"
                    * Прилив и отлив
                    * Прилив и местные условия
                    * Неправильные и смешанные приливы
                    * Самые высокие приливы
                    * Приливы в проливах и устьях рек
                    * Приливы и судоходство. "Синий уголь"
                  </li>
                  <li>
                * Прибой
                    * Морская зыбь
                    * Разрушение волн
                    * Бурун. Взбросы волн
                    * Разрушительные волны "цунами"
                    * Существует ли "девятый вал"
                    * Рефракция волн
                    * Работа прибоя
                    * Разрушение крутого берега. Морские террассы
                        * 96/97
                    * Борьба с прибоем. Проекты использования энергии прибоя
                  </li>
                  <li>
                * Ледники
                    * Ледники - продукт климата
                    * Строение ледников
                    * Ледники питают реки
                    * Ледяные горы - айсберги
                    * Движение ледников
                    * Оледенение материков в далеком прошлом
                    * Изучение ледников
                  </li>
                  <li>
                * Лавины
                    * Причины возникновения лавин
                    * Борьба с лавинами
                  </li>
                  <li>
                * Воды суши
                    * Реки
                    * Питание рек
                    * Речная система. Бассейн. Водораздел
                    * Живое сечение реки. Расход воды. Годовой сток
                    * Реки равнинные и горные
                    * Водопады
                    * Горно-равнинные реки
                    * Преобразование рек
                    * Величайшие реки мира
                    * Озера
                    * Происхождение озерных котловин
                    * Озера сточные и бессточные
                    * Движение воды в озерах
                    * Стадии развития озер
                    * Озера смягчают климат
                    * Хозяйственное значение озер
                    * Самые большие и глубокие озера
                  </li>
                </ul>
                <h4>Воздушная оболочка Земли</h4>
                <ul>
                  <li>
                * Атмосфера
                    * Тяжесть воздушного океана. Изобары
                    * Как образуется ветер. Циклоны и антициклоны
                    * Общая циркуляция атмосферы. Пассаты и антипассаты
                    * Водяной пар в воздухе
                    * Как образуется дождь и снег
                    * Воздушные массы приносят потепления и похолодания
                    * Признаки ухудшения погоды
                    * Как возникает ненастная погода. Фронт в атмосфере
                    * Теплый фронт
                    * Холодный фронт
                    * Предсказание погоды
                  </li>
                  <li>
                * Грозные и "необыкновенные" явления в атмосфере
                    * Грозы
                        * 128/129
                    * Ливни и наводнения
                    * Градобития
                    * Шториы (бури), ураганы, тайфуны
                    * Шквалы
                    * Смерчи (торнадо, тромб)
                    * Местные бури
                    * Мираж
                    * Гало
                    * Радуга
                        * 144/145
                  </li>
                  <li>
                * Как изучают погоду
                    * Метеорологические станции
                    * Синоптическая карта
                    * Метеорологическая и гидрологическая служба
                    * Оборудование метеорологической станции. Наблюдения за погодой
                    * Школьные метеорологические станции
                  </li>
                  <li>
                    Служба погоды в народном хозяйстве
                  </li>
                  <li>
                * Климаты земного шара
                    * Погода и климат
                    * От чего зависит климат
                    * Самые холодные места на Земле
                    * Самые жаркие места на Земле
                    * Классификация климата
                    * Изменения климата
                        * 160/161
                    * Климатология
                    * Климат и человек
                  </li>
                </ul>
                <h4>Почвы и растительность Земли</h4>
                <ul>
                  <li>
                * Почвы
                    * Структура почвы и ее значение
                    * Эрозия почв и борьба с ней
                    * Почвы тундры
                    * Почвы хвойно-лесной зоны
                    * Серые  и бурые почвы лиственных лесов
                    * Черноземные почвы степи
                        * 168/169
                    * Каштановые почвы сухой степи
                    * Почвы пустынь
                    * Почвы влажных субтропиков и тропической зоны
                    * Горные почвы
                    * Почвы речных пойм
                  </li>
                  <li>
                * Растительный мир
                    * Растения дикорастущие и культурные. Ареал. Растительное сообщество
                    * Растительность и флора
                  </li>
                  <li>
                    Зона тундр
                  </li>
                  <li>
                    Зона лесов
                        * 176/177
                  </li>
                  <li>
                    Зона степей
                  </li>
                  <li>
                    Зона пустынь
                  </li>
                  <li>
                    Леса субтропиков
                        * 184/185
                  </li>
                  <li>
                    Зона тропической растительности
                  </li>
                </ul>
                <h4>Животный мир земного шара</h4>
                <ul>
                  <li>
                * Животный мир суши
                    * Животные Арктики и Антарктики
                        * 192/193
                    * Животные тундры
                    * Животные тайги
                    * Обитатели пояса широколиственных лесов
                    * Животные степей и саванн
                        * 200/201
                    * Животные пустынь
                    * Животные тропического леса
                        * 208/209
                    * Австралийская область
                    * Неотропическая область
                    * Эфиопская область
                    * Индо-Малайская область
                    * Голарктическая область
                  </li>
                  <li>
                * Жизнь в океанах и морях
                    * Водная среда и ее особенности
                    * От поверхности моря до океанских глубин
                    * По морям и океанам
                        * 224/225
                  </li>
                  <li>
                * Открыватели морских тайн
                    * Организация исследований
                    * Работа на станции
                    * Исследования дна моря и его обитателей
                    * Исследование геологического строения дна моря
                    * Изучение погоды
                  </li>
                </ul>
                <h4>Население Земли</h4>
                <ul>
                  <li>
                * Население земного шара
                    * Может ли быть Земля перенаселена
                    * Расселение людей на Земле. Плотность населения
                    * Расы людей
                    * Основные расы и их современное распространение
                    * Происхождение рас
                    * Языки народов мира
                    * Языковое родство народов
                    * Племена, народности и нации
                        * 240/241
                  </li>
                </ul>
                <h4>СССР на карте мира</h4>
                <ul>
                  <li>
                * СССР - страна строящегося коммунизма
                    * Арктика (ледяная зона)
                    * Зона тундры
                    * Зона лесов
                    * Зона степей
                    * Зона полупустынь и пустынь
                    * Горы
                        * 264/265
                        * 264/265
                    * Субтропики
                    * Страна сокровищ
                    * Государство нового типа
                    * Москва
                    </li>
                  </ul>
                </v-container>
              </v-card>
            </v-container>
          </v-flex>
          <v-flex xs4>
            <v-container>
              <v-card>
                <v-card-title>
                  <h3>Исследователи Земли</h3>
                </v-card-title>
                <v-container>
                <h4>Старинные землепроходцы и мореплаватели</h4>
                <ul>
                  <li>
                    Китайский землепроходец Чжан Цянь
                  </li>
                  <li>
                    По следам малайских мореходов
                  </li>
                  <li>
                    Марко Поло
                  </li>
                  <li>
                    Путешествия в Индию Афанасия Никитина
                  </li>
                </ul>
                <h4>Эпоха великих географических открытий</h4>
                <ul>
                  <li>
                    Великие географические открытия
                  </li>
                  <li>
                    Подвиг Колумба
                  </li>
                  <li>
                    Морской путь в Индию
                  </li>
                  <li>
                    "Южное море" - Тихий океан
                  </li>
                  <li>
                    Откуда произошло название "Америка"
                  </li>
                  <li>
                    Первое кругосветное плавание
                  </li>
                  <li>
                    Открытие Австралии
                  </li>
                  <li>
                    Землепроходцы на Тихом океане
                  </li>
                  <li>
                    Поход Василия Пояркова на Амур
                  </li>
                  <li>
                    Русский землепроходец Ерофей Павлович Хабаров
                  </li>
                  <li>
                    Открытие пролива между Азией и Америкой
                  </li>
                </ul>
                <h4>Географические открытия и исследования XVIII в.</h4>
                <ul>
                  <li>
                * Экспедиции В. Беринга и А. И. Чирикова
                    * Первая Камчатская экспедиция
                    * Вторая Камчатская экспедиция
                    * Плавание В. Беринга к Америке
                    * Плавание А. И. Чирикова
                    * Плавание к берегам Японии
                  </li>
                  <li>
                * Великая Северная экспедиция
                    * Плавания от Архангельска до устья Оби
                    * От Оби до Енисея
                    * От устья Лены к Енисею
                    * На восток от Лены
                  </li>
                  <li>
                    Михаил Васильевич Ломоносов как географ
                  </li>
                  <li>
                    Русский мореплаватель и исследователь Америки Г. И. Шелихов
                  </li>
                  <li>
                    Плавания Джеймса Кука
                  </li>
                </ul>
                <h4>Исследования XIX и XX вв.</h4>
                <ul>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                    </li>
                  </ul>
                  <h4>Завоевание высоких широт</h4>
                  <ul>
                    <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                    * Марко Поло
                    * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                    </li>
                  </ul>
                  <h4>Юные географы, краеведы, путешественники</h4>
                  <ul>
                    <li>
                * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                    * Марко Поло
                        * 504/505
                    * Марко Поло
                    * Марко Поло
                    * Марко Поло
                    * Марко Поло
                  </li>
                  <li>
                * Марко Поло
                        * 512/513
                    </li>
                  </ul>
                </v-container>
              </v-card>
            </v-container>
          </v-flex>
          <v-flex xs4>
            <v-container>
              <v-card>
                <v-card-title>
                  <h3>Справочный отдел</h3>
                </v-card-title>
                <v-container>
                  <ul>
                    <li>
                      Справочные сведения о Земле
                    </li>
                    <li>
                      Хронологические таблицы
                        * Древний мир
                        * Средние века
                        * Новое время
                    </li>
                    <li>
                      Что читать по географии
                        * Общее землеведение
                        * Воздушная оболочка Земли
                        * Водная оболочка Земли
                        * Суша
                        * География СССР
                        * История географических исследований и развития географических знаний
                        * Советские исследования в Арктике и Антарктике
                        * Выдающиеся русские географы и путешественники
                        * Выдающиеся зарубежные географы и путешественники
                        * В помощь юным географам и краеведам
                    </li>
                    <li>
                      Указатель имен и предметов
                    </li>
                  </ul>
                </v-container>
              </v-card>
            </v-container>
          </v-flex>
          <v-flex xs4>
            <v-container>
              <v-card>
                <v-list>
                  <v-list-tile
                    v-for="(page, id) in world.pages"
                    :key="`page-${id}`"
                    :to="`/wiki/${page.url}`"
                    :title="page.filename"
                  >
                    <v-list-tile-content>
                      <v-list-tile-title v-text="page.filename" />
                    </v-list-tile-content>
                  </v-list-tile>
                </v-list>
              </v-card>
            </v-container>
          </v-flex>
          <v-flex xs8>
            <slot />
          </v-flex>
      </v-layout>
    </template>
  </v-container>
</template>

<script>
export default {
  name: 'Planet',
  props: [
    'world',
    'planet',
  ],
  data: () => ({}),
};
</script>
