<template>
  <v-container>
    <world-card
      v-if="world"
      :world="world"
    >
      <v-card-title>
        <h2
          v-text="planet.name"
        ></h2>
      </v-card-title>
      <v-layout row wrap>
        <v-flex xs4>
          <v-container>
            <v-card>
              <v-container>
                <p>
                  The planet ${1:Qo'noS}${2:, named so by its discoverer}, is a ${3:desert planet} in a ${4:small solar systemwith }${5: ten} other planets.
                  <br />
                  ${1:Qo'noS} is about ${6:15.9} times bigger than Earth and its gravity is about ${7:5.04} times that of Earth.
                </p>
                <p>
                  A single day lasts ${8:47.21} hours and a year lasts ${9:487} days. The planet is made up of ${10:13} continents, which make up ${11:46}% of the planet's landmass.
                  <br />
                  ${12:1} moon(s) orbit the planet and ${1:Qo'noS} itself orbits a${13: white} sun in an ${14:elliptic orbit}.
                </p>
                <p>
                  The plant-like organisms on this planet are ${21:almost entirely made up of grasses and bushes, both of which work together to reach the nutrients they need. Their intertwined growth leads to spectacular shapes and colors, but they leave almost no nutrients for other species. So only small flowers and some fungi manage to live of what's left. Trees and shrubs are non-existent.}
                </p>
                <p>
                  ${22:Most plant-like organisms tend to grow in one place or at least float around in water, but a small amount of species on this planet isn't content with this, mainly due to the risk of a lack of nutrients in the soil around it. So instead these species try to attach themselves to small animals. Their survival has a better chance if they manage to intertwine with a furry animal for more grasp. After they've attached themselves to an animal, it will use dirt, dead skin and anything else that may fall on the animal's skin as nutrients, but some may even pierce the skin to take nutrients from the animal's blood.}
                </p>
                <p>
                  ${22:The aquatic organisms aren't very large in numbers, but they are huge in size. They can grow to sizes of nearly 100 meters (328ft) and a diameter of up to 5 meters (16ft). These underwater giants give this aquatic world an eerie atmosphere as you never know what could lurk behind that pillar. But at the same time, they provide homes to thousands of species on all depths, which makes studying even 1 giant coral an absolute delight.}
                </p>
                <p>
                  ${23:Evil alien species who wish to destroy the universe are a common theme in sci-fi movies. However, it turns out it's not that far from reality. The species on this planet are what we'd consider truly evil. Their superior technology has been the end of many species, both on their own planet and others. Having virtually destroyed most life their own planet, these hostile creatures now search the universe for resources they can use on their home-planet. No other species has had the capabilities to stand in their way, yet.}
                </p>
              </v-container>
            </v-card>
          </v-container>
        </v-flex>
        <v-flex xs4>
          <v-container>
            <v-card>
              <v-card-title>
                <h3>Природа и люди</h3>
              </v-card-title>
              <v-container>
              <h4>{{planet.name}} как планета и ее изображение на карте</h4>
              <ul>
                <li
                  v-for="article in planet.about"
                  :key="article.slug"
                >
                  <router-link
                    :to="`/world/${world.title}/planet/${article.slug}`"
                    v-text="article.title"
                  ></router-link>
                  <ul
                    v-if="article.children"
                  >
                    <li
                      v-for="child in article.children"
                      :key="child.slug"
                    >
                      <router-link
                        :to="`/world/${world.title}/planet/${article.slug}/${child.slug}`"
                        v-text="child.title"
                      ></router-link>
                    </li>
                  </ul>
                </li>
              </ul>
              <h4>Строение Земли</h4>
               <ul>
                <li>
                * Поверхность Земли
                  * Мировой океан
                  * Воздушный океан
                  * Сфера жизни
                  * Плотность Земли
                </li>
                <li>
                * Земля - большой магнит
                  * Магнитная стрелка - указатель стран света
                  * Магнитное поле Земли
                  * Магнитное склонение. Магнитные полюсы
                  * Навигация
                  * Служба земного магнетизма
                  * Земной магнетизм дает возможность разведывать недра земного шара
                  * Изменения магнитного поля Земли
                  * Магнитные бури. Полярные сияния
                  * Происхождение магнитного поля Земли
                      * 64/65
                </li>
              </ul>
              <h4>Суша</h4>
              <ul>
                <li>
              * Рельеф суши
                  * Значение рельефа для климата и растительности
                  * Основные формы рельефа
                  * Как возникают формы рельефа
                  * Как изучают рельеф Земли
                  * Значение рельефа Земли в хозяйственной деятельности человека
                </li>
              </ul>
              <h4>Водная оболочка Земли</h4>
              <ul>
                <li>
              * Океаны и моря
                  * Рельеф дна Мирового океана
                  * Северный Ледовитый океан
                  * Атлантический океан
                  * Индийский океан
                  * Тихий океан
                  * Глубины морей
                  * Соленость морской воды
                  * Температура морской воды
                      * 80/81
                  * Замерзание морской воды
                  * Круговорот воды в Мировом океане
                </li>
                <li>
              * Течения Мирового океана
                  * Причины морских течений
                  * Схемы течений Мирового океана
                  * Влияние морских течений на климат и судозодство
                </li>
                <li>
              * Приливы и отливы
                  * Нагон и сгон воды. "Моряна"
                  * Прилив и отлив
                  * Прилив и местные условия
                  * Неправильные и смешанные приливы
                  * Самые высокие приливы
                  * Приливы в проливах и устьях рек
                  * Приливы и судоходство. "Синий уголь"
                </li>
                <li>
              * Прибой
                  * Морская зыбь
                  * Разрушение волн
                  * Бурун. Взбросы волн
                  * Разрушительные волны "цунами"
                  * Существует ли "девятый вал"
                  * Рефракция волн
                  * Работа прибоя
                  * Разрушение крутого берега. Морские террассы
                      * 96/97
                  * Борьба с прибоем. Проекты использования энергии прибоя
                </li>
                <li>
              * Ледники
                  * Ледники - продукт климата
                  * Строение ледников
                  * Ледники питают реки
                  * Ледяные горы - айсберги
                  * Движение ледников
                  * Оледенение материков в далеком прошлом
                  * Изучение ледников
                </li>
                <li>
              * Лавины
                  * Причины возникновения лавин
                  * Борьба с лавинами
                </li>
                <li>
              * Воды суши
                  * Реки
                  * Питание рек
                  * Речная система. Бассейн. Водораздел
                  * Живое сечение реки. Расход воды. Годовой сток
                  * Реки равнинные и горные
                  * Водопады
                  * Горно-равнинные реки
                  * Преобразование рек
                  * Величайшие реки мира
                  * Озера
                  * Происхождение озерных котловин
                  * Озера сточные и бессточные
                  * Движение воды в озерах
                  * Стадии развития озер
                  * Озера смягчают климат
                  * Хозяйственное значение озер
                  * Самые большие и глубокие озера
                </li>
              </ul>
              <h4>Воздушная оболочка Земли</h4>
              <ul>
                <li>
              * Атмосфера
                  * Тяжесть воздушного океана. Изобары
                  * Как образуется ветер. Циклоны и антициклоны
                  * Общая циркуляция атмосферы. Пассаты и антипассаты
                  * Водяной пар в воздухе
                  * Как образуется дождь и снег
                  * Воздушные массы приносят потепления и похолодания
                  * Признаки ухудшения погоды
                  * Как возникает ненастная погода. Фронт в атмосфере
                  * Теплый фронт
                  * Холодный фронт
                  * Предсказание погоды
                </li>
                <li>
              * Грозные и "необыкновенные" явления в атмосфере
                  * Грозы
                      * 128/129
                  * Ливни и наводнения
                  * Градобития
                  * Шториы (бури), ураганы, тайфуны
                  * Шквалы
                  * Смерчи (торнадо, тромб)
                  * Местные бури
                  * Мираж
                  * Гало
                  * Радуга
                      * 144/145
                </li>
                <li>
              * Как изучают погоду
                  * Метеорологические станции
                  * Синоптическая карта
                  * Метеорологическая и гидрологическая служба
                  * Оборудование метеорологической станции. Наблюдения за погодой
                  * Школьные метеорологические станции
                </li>
                <li>
                  Служба погоды в народном хозяйстве
                </li>
                <li>
              * Климаты земного шара
                  * Погода и климат
                  * От чего зависит климат
                  * Самые холодные места на Земле
                  * Самые жаркие места на Земле
                  * Классификация климата
                  * Изменения климата
                      * 160/161
                  * Климатология
                  * Климат и человек
                </li>
              </ul>
              <h4>Почвы и растительность Земли</h4>
              <ul>
                <li>
              * Почвы
                  * Структура почвы и ее значение
                  * Эрозия почв и борьба с ней
                  * Почвы тундры
                  * Почвы хвойно-лесной зоны
                  * Серые  и бурые почвы лиственных лесов
                  * Черноземные почвы степи
                      * 168/169
                  * Каштановые почвы сухой степи
                  * Почвы пустынь
                  * Почвы влажных субтропиков и тропической зоны
                  * Горные почвы
                  * Почвы речных пойм
                </li>
                <li>
              * Растительный мир
                  * Растения дикорастущие и культурные. Ареал. Растительное сообщество
                  * Растительность и флора
                </li>
                <li>
                  Зона тундр
                </li>
                <li>
                  Зона лесов
                      * 176/177
                </li>
                <li>
                  Зона степей
                </li>
                <li>
                  Зона пустынь
                </li>
                <li>
                  Леса субтропиков
                      * 184/185
                </li>
                <li>
                  Зона тропической растительности
                </li>
              </ul>
              <h4>Животный мир земного шара</h4>
              <ul>
                <li>
              * Животный мир суши
                  * Животные Арктики и Антарктики
                      * 192/193
                  * Животные тундры
                  * Животные тайги
                  * Обитатели пояса широколиственных лесов
                  * Животные степей и саванн
                      * 200/201
                  * Животные пустынь
                  * Животные тропического леса
                      * 208/209
                  * Австралийская область
                  * Неотропическая область
                  * Эфиопская область
                  * Индо-Малайская область
                  * Голарктическая область
                </li>
                <li>
              * Жизнь в океанах и морях
                  * Водная среда и ее особенности
                  * От поверхности моря до океанских глубин
                  * По морям и океанам
                      * 224/225
                </li>
                <li>
              * Открыватели морских тайн
                  * Организация исследований
                  * Работа на станции
                  * Исследования дна моря и его обитателей
                  * Исследование геологического строения дна моря
                  * Изучение погоды
                </li>
              </ul>
              <h4>Население Земли</h4>
              <ul>
                <li>
              * Население земного шара
                  * Может ли быть Земля перенаселена
                  * Расселение людей на Земле. Плотность населения
                  * Расы людей
                  * Основные расы и их современное распространение
                  * Происхождение рас
                  * Языки народов мира
                  * Языковое родство народов
                  * Племена, народности и нации
                      * 240/241
                </li>
              </ul>
              <h4>СССР на карте мира</h4>
              <ul>
                <li>
              * СССР - страна строящегося коммунизма
                  * Арктика (ледяная зона)
                  * Зона тундры
                  * Зона лесов
                  * Зона степей
                  * Зона полупустынь и пустынь
                  * Горы
                      * 264/265
                      * 264/265
                  * Субтропики
                  * Страна сокровищ
                  * Государство нового типа
                  * Москва
                  </li>
                </ul>
              </v-container>
            </v-card>
          </v-container>
        </v-flex>
        <v-flex xs4>
          <v-container>
            <v-card>
              <v-card-title>
                <h3>Исследователи Земли</h3>
              </v-card-title>
              <v-container>
              <h4>Старинные землепроходцы и мореплаватели</h4>
              <ul>
                <li>
                  Китайский землепроходец Чжан Цянь
                </li>
                <li>
                  По следам малайских мореходов
                </li>
                <li>
                  Марко Поло
                </li>
                <li>
                  Путешествия в Индию Афанасия Никитина
                </li>
              </ul>
              <h4>Эпоха великих географических открытий</h4>
              <ul>
                <li>
                  Великие географические открытия
                </li>
                <li>
                  Подвиг Колумба
                </li>
                <li>
                  Морской путь в Индию
                </li>
                <li>
                  "Южное море" - Тихий океан
                </li>
                <li>
                  Откуда произошло название "Америка"
                </li>
                <li>
                  Первое кругосветное плавание
                </li>
                <li>
                  Открытие Австралии
                </li>
                <li>
                  Землепроходцы на Тихом океане
                </li>
                <li>
                  Поход Василия Пояркова на Амур
                </li>
                <li>
                  Русский землепроходец Ерофей Павлович Хабаров
                </li>
                <li>
                  Открытие пролива между Азией и Америкой
                </li>
              </ul>
              <h4>Географические открытия и исследования XVIII в.</h4>
              <ul>
                <li>
              * Экспедиции В. Беринга и А. И. Чирикова
                  * Первая Камчатская экспедиция
                  * Вторая Камчатская экспедиция
                  * Плавание В. Беринга к Америке
                  * Плавание А. И. Чирикова
                  * Плавание к берегам Японии
                </li>
                <li>
              * Великая Северная экспедиция
                  * Плавания от Архангельска до устья Оби
                  * От Оби до Енисея
                  * От устья Лены к Енисею
                  * На восток от Лены
                </li>
                <li>
                  Михаил Васильевич Ломоносов как географ
                </li>
                <li>
                  Русский мореплаватель и исследователь Америки Г. И. Шелихов
                </li>
                <li>
                  Плавания Джеймса Кука
                </li>
              </ul>
              <h4>Исследования XIX и XX вв.</h4>
              <ul>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                  </li>
                </ul>
                <h4>Завоевание высоких широт</h4>
                <ul>
                  <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                  * Марко Поло
                  * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                  </li>
                </ul>
                <h4>Юные географы, краеведы, путешественники</h4>
                <ul>
                  <li>
              * Марко Поло
                </li>
                <li>
              * Марко Поло
                  * Марко Поло
                      * 504/505
                  * Марко Поло
                  * Марко Поло
                  * Марко Поло
                  * Марко Поло
                </li>
                <li>
              * Марко Поло
                      * 512/513
                  </li>
                </ul>
              </v-container>
            </v-card>
          </v-container>
        </v-flex>
        <v-flex xs4>
          <v-container>
            <v-card>
              <v-card-title>
                <h3>Справочный отдел</h3>
              </v-card-title>
              <v-container>
                <ul>
                  <li>
                    Справочные сведения о Земле
                  </li>
                  <li>
                    Хронологические таблицы
                      * Древний мир
                      * Средние века
                      * Новое время
                  </li>
                  <li>
                    Что читать по географии
                      * Общее землеведение
                      * Воздушная оболочка Земли
                      * Водная оболочка Земли
                      * Суша
                      * География СССР
                      * История географических исследований и развития географических знаний
                      * Советские исследования в Арктике и Антарктике
                      * Выдающиеся русские географы и путешественники
                      * Выдающиеся зарубежные географы и путешественники
                      * В помощь юным географам и краеведам
                  </li>
                  <li>
                    Указатель имен и предметов
                  </li>
                </ul>
              </v-container>
            </v-card>
          </v-container>
        </v-flex>
        <v-flex xs4>
          <v-container>
            <v-card>
              <v-list>
                <v-list-tile
                  v-for="(page, id) in world.pages"
                  :key="`page-${id}`"
                  :to="`/wiki/${page.url}`"
                  :title="page.filename"
                >
                  <v-list-tile-content>
                    <v-list-tile-title v-text="page.filename" />
                  </v-list-tile-content>
                </v-list-tile>
              </v-list>
            </v-card>
          </v-container>
        </v-flex>
        <v-flex xs8>
          <slot />
        </v-flex>
      </v-layout>
    </world-card>
  </v-container>
</template>

<script>
export default {
  name: 'Planet',
  components: {
    WorldCard: () => import('@/components/WorldCard.vue'),
  },
  props: [
    'world',
  ],
  data: () => ({
    planet: {
      name: 'Земля',
      // ${1}${2}${3}${4}${5}
      // ${1}${2}${3}${6}
      // ${1}${4}${5}
      // ${3b}${2.0}${1}${2.1}${5}
      // ${3b}${6} ${7.0}${7.1}${7.2}${7.3}
      about: [
        {slug: 1, title: 'Представление древних народов о Земле'},
        {slug: 2, title: 'Как впервые измерили окружность Земли'},
        {slug: 3, title: 'Как уточнялись знания о форме и величине Земли'},
        {slug: 4, title: 'Суточное вращение Земли. Смена дня и ночи'},
        {slug: 5, title: 'Как первые кругосветные путешественники потеряли день'},
        {slug: 6, title: 'Движение Земли вокруг Солнца'},
        {slug: 7, title: 'Смена времен года'},
        {
          slug: 8,
          title: 'Топографический план и карта',
          children: [
            {slug: 81, title: 'Что такое топографический план и карта'},
            {slug: 82, title: 'Глобус и карта'},
            {slug: 83, title: 'Типы карт'},
            {slug: 84, title: 'Картографические проекции'},
            {slug: 85, title: 'Как создается карта'},
            {slug: 86, title: 'О чем рассказывает карта'},
            {slug: 87, title: 'Из истории создания карт'},
            {slug: 88, title: 'Из истоии русской картографии'},
            {slug: 89, title: 'Советская картография'},
          ],
        },
      ],
    },
  }),
};
</script>
